Revit 2027 API
Selection.PickPoint Method
Prompts the user to pick a point on the active work plane.
Overload List
Name | Description
PickPoint() | Prompts the user to pick a point on the active work plane.
PickPoint(ObjectSnapTypes) | Prompts the user to pick a point on the active work plane using specified snap settings.
PickPoint(String) | Prompts the user to pick a point on the active work plane while showing a custom status prompt string.
PickPoint(ObjectSnapTypes, String) | Prompts the user to pick a point on the active work plane using specified snap settings while showing a custom status prompt string.
Top
See Also
Reference
Selection Class
Autodesk.Revit.UI.Selection Namespace